#include "zyxstm8.h"
#include "gpio_stm8.h"


/******************************************************************
 * 功能：配置I/O
 * 参数：I/O组, I/O号, I/O数据方向, I/O模式, I/O配置 
 * 返回：
******************************************************************/
void Conf_Port( GPIO_TypeDef *GPIOx, PIN pin, IO_DIR dir, IO_MODE mode, IO_CONF conf )
{
    GPIOx->DDR |= dir<<pin;
    GPIOx->CR1 |= mode<<pin;
    GPIOx->CR2 |= conf<<pin;
}


/******************************************************************
 * 功能：设置I/O输出高电平
 * 参数：I/O组, I/O号
 * 返回：无
******************************************************************/
void Set_Pin( GPIO_TypeDef *GPIOx, PIN pin )
{
    GPIOx->ODR |= 1<<pin;
}


/******************************************************************
 * 功能：设置I/O输出低电平
 * 参数：I/O组, I/O号
 * 返回：无
******************************************************************/
void Cls_Pin( GPIO_TypeDef *GPIOx, PIN pin )
{
    GPIOx->ODR &= ~(1<<pin);
}


/******************************************************************
 * 功能：设置I/O输出电平
 * 参数：I/O组, I/O号, I/O电平  0低 非0高
 * 返回：
******************************************************************/
void Set_Pin_Level( GPIO_TypeDef *GPIOx, PIN pin, u8 level )
{
    ( level ) ? Set_Pin( GPIOx, pin ) : Cls_Pin( GPIOx, pin );
}
